Repository: adrian-cerdeira/NeosTwoFactorAuthentication
Catalog: Resources/Private/Translations/*/Backend.xlf
Languages: de

# module.label
source: Two-Factor Authentication
de: Zwei-Faktor-Authentifizierung

# module.description
source: This module allows registering and managing a second factor for the backend login.
de: Dieses Modul erlaubt die Einrichtung und Verwaltung eines zweiten Faktors für das Backend-Login.

# module.index.title
source: List of all registered second factors
de: Liste aller registrierten zweiten Faktoren

# module.index.list.header.type
source: Type
de: Typ

# module.index.list.action.delete
source: Delete second factor
de: Zweiten Faktor löschen

# module.index.create
source: Create second factor
de: Zweiten Faktor erstellen

# module.index.delete.header
source: Do you really want to delete the second factor?
de: Wollen Sie den zweiten Faktor wirklich löschen?

# module.index.delete.text
source: Deleting a second factor can not be undone.
de: Das Löschen eines zweiten Faktors kann nicht rückgängig gemacht werden.

# module.index.delete.cancel
source: Cancel
de: Abbrechen

# module.index.delete.confirm
source: Delete second factor
de: Zweiten Faktor löschen

# module.index.delete.flashMessage.errorHeader
source: Error
de: Fehler

# module.index.delete.flashMessage.secondFactorDeleted
source: The second factor was deleted.
de: Der zweite Faktor wurde gelöscht.

# module.index.delete.flashMessage.cannotRemoveLastSecondFactor
source: Cannot remove the last second factor because the two-factor authentication is enforced.
de: Der letzte zweite Faktor kann nicht gelöscht werden, da die Zwei-Faktor-Authentifizierung erzwungen wird.

# module.new.title
source: Register new second factor
de: Neuen zweiten Faktor registrieren

# module.new.description
source: To register a new second factor, scan the QR code with any TOTP app (e.g. Google Authenticator, Microsoft Authenticator, Authy) and enter the code.
de: Scannen Sie den QR-Code in Ihrer TOTP-App (z.B. Google Authenticator, Microsoft Authenticator, Authy) und geben Sie den Code ein, um einen neuen zweiten Faktor zu registrieren.

# module.new.submit-otp
source: Register new OTP
de: Neues OTP registrieren

# module.new.flashMessage.submittedOtpIncorrect
source: Submitted OTP was incorrect.
de: Das eingegebene OTP ist nicht korrekt.

# module.new.flashMessage.successfullyRegisteredOtp
source: OTP was registered successfully.
de: Das OTP wurde erfolgreich registriert.
